Revit 2025 API
AnalyticalNodeConnectionStatus Enumeration
 Indicates the Connections Status for an Analytical Node.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum AnalyticalNodeConnectionStatus
Public Enumeration AnalyticalNodeConnectionStatus
public enum class AnalyticalNodeConnectionStatus
type AnalyticalNodeConnectionStatus
Members
Member name | Value | Description
Unconnected | 0 |  Unconnected node (only one connected element)
Connected | 1 |  Connected
See Also
Reference
Autodesk.Revit.DB.Structure Namespace